PavloLevush/self-driving-electric-car/Mesh_Flood_PSoC4BLE.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PrISM_2</name>
      <description>PrISM</description>
      <baseAddress>0x0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PrISM_SEED</name>
          <description>Current seed value</description>
          <addressOffset>0x400F0003</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>PrISM_POLYNOM</name>
          <description>Polynomial</description>
          <addressOffset>0x400F0013</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>PrISM_DENSITY0</name>
          <description>Pulse Density 0</description>
          <addressOffset>0x400F0023</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>PrISM_DENSITY1</name>
          <description>Pulse Density 1</description>
          <addressOffset>0x400F0033</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>PrISM_SEED_COPY</name>
          <description>Start seed value</description>
          <addressOffset>0x400F0043</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>PrISM_CONTROL</name>
          <description>Control register</description>
          <addressOffset>0x400F0073</addressOffset>
          <size>3</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>compare_type1</name>
              <description>XX</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>compare_type0</name>
              <description>No description available</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ctrl_enable</name>
              <description>No description available</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PrISM_1</name>
      <description>PrISM</description>
      <baseAddress>0x0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PrISM_SEED</name>
          <description>Current seed value</description>
          <addressOffset>0x400F0000</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>PrISM_POLYNOM</name>
          <description>Polynomial</description>
          <addressOffset>0x400F0010</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>PrISM_DENSITY0</name>
          <description>Pulse Density 0</description>
          <addressOffset>0x400F0020</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>PrISM_DENSITY1</name>
          <description>Pulse Density 1</description>
          <addressOffset>0x400F0030</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>PrISM_SEED_COPY</name>
          <description>Start seed value</description>
          <addressOffset>0x400F0040</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>PrISM_CONTROL</name>
          <description>Control register</description>
          <addressOffset>0x400F0070</addressOffset>
          <size>3</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>compare_type1</name>
              <description>XX</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>compare_type0</name>
              <description>No description available</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ctrl_enable</name>
              <description>No description available</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
